In [2]:
import pandas as pd
import numpy as np

In [3]:
df_train = pd.read_csv("./train.tsv",sep="\t")
df_test = pd.read_csv("./test.tsv",sep="\t")
df_sample_submit = pd.read_csv("./sample_submit.csv")
display(df_train.head())
display(df_test.head())
display(df_sample_submit.head())

,Unnamed: 0,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,0,39.4,4,85.0,70,2070,18.6,78,3,datsun b210 gx
1,3,18.0,6,171.0,97,2984,14.5,75,1,ford pinto
2,9,32.7,6,168.0,132,2910,11.4,80,3,datsun 280-zx
3,11,38.1,4,89.0,60,1968,18.8,80,3,toyota corolla tercel
4,13,28.0,4,98.0,80,2164,15.0,72,1,dodge colt (sw)

,Unnamed: 0,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,1,8,350.0,180,4499,12.5,73,1,oldsmobile vista cruiser
1,2,4,156.0,105,2745,16.7,78,1,plymouth sapporo
2,4,6,156.0,108,2930,15.5,76,3,toyota mark ii
3,5,4,108.0,70,2245,16.9,82,3,toyota corolla
4,6,4,105.0,63,2125,14.7,82,1,plymouth horizon miser

   1  40.9
0  2  28.8
1  4  11.0
2  5  19.4
3  6  14.0
4  7  32.9

In [48]:
df_horsepower = df_train[df_train["horsepower"] != "?"]
df_horsepower["horsepower"] = df_horsepower["horsepower"].astype("int64")
horsepower_mean= df_horsepower["horsepower"].mean()
horsepower_mean
df_train["horsepower"] = df_train["horsepower"].apply(lambda x: horsepower_mean if x == "?" else x)
df_train["horsepower"] = df_train["horsepower"].astype("int64")
df_train.mean()

C:\Users\cax68\AppData\Local\Temp/ipykernel_14900/1396690657.py:9: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_train.mean()

Unnamed: 0       200.170854
mpg               22.997990
cylinders          5.527638
displacement     200.889447
horsepower       107.246231
weight          3063.326633
acceleration      15.599497
model year        75.904523
origin             1.587940
dtype: float64

In [49]:
df_test[df_test["horsepower"] == "?"]

,Unnamed: 0,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
50,101,4,151.0,?,3035,20.5,82,1,amc concord dl
85,164,6,200.0,?,2875,17.0,74,1,ford maverick
181,363,4,98.0,?,2046,19.0,71,1,ford pinto